In [85]:
import pandas
import warnings
warnings.filterwarnings('ignore')

In [9]:
data = pandas.read_csv('C:\\Users\\kvanc\\coursera\\files\\titanic.csv', index_col = 'PassengerId')

In [10]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [109]:
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [13]:
data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [110]:
342 / 891

0.3838383838383838

In [20]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [111]:
216 / 891

0.24242424242424243

In [22]:
data['Age'].mean()

29.69911764705882

In [23]:
data['Age'].median()

28.0

In [36]:
data1 = data.loc[:, 'SibSp':'Parch']
data1.corr()

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

In [101]:
name = []
for name_1 in data['Name']:
    if 'Mrs' in name_1:
        name += [name_1[name_1.find('Mrs.') + 5:]]
    elif 'Miss' in name_1:
        name += [name_1[name_1.find('Miss.') + 5:]]
    elif 'Mr' not in name_1 and 'Master' not in name_1 and 'Major' not in name_1 and 'Dr' not in name_1 and 'Rev' not in name_1:
        print(name_1)

Uruchurtu, Don. Manuel E
Aubart, Mme. Leontine Pauline
Reynaldo, Ms. Encarnacion
Sagesser, Mlle. Emma
Simonius-Blumer, Col. Oberst Alfons
Weir, Col. John
Crosby, Capt. Edward Gifford
Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)
Reuchlin, Jonkheer. John George

In [65]:
name += ['Emma'] + ['Lucy'] + ['Encarnacion'] + ['Leontine']

In [104]:
names = {}
for i in range(len(name)):
    names[name[i]] = name.count(name[i])

In [107]:
max(names.values())

6

In [108]:
for key, value in names.items():
    if value == 6:
        print(key)

 Mary